w7d2/MusicApp/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ICCRZM7aZiwbf1DN2tBzlw"], ["updated_at", "2021-01-05 22:12:25.529443"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = self.generate_session_token
        self.save!