w6d2/first_routes_and_controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Gino"], ["email", "gino@aa.com"]]
---
    def create
        user = User.new(user_params)
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "Dongsooo"], ["id", 2]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)